#include "global.h"
#include "core.h"
#include "flags.h"
#include "code_z_1.h" // CopyPalette
#include "module_unclear.h"
#include "lib/m4a/m4a.h"
#include "game/save.h"
#include "game/stage.h"

#include "constants/songs.h"

// BUG: Note that resultVar in the CS_SIO_CHECK_*() macros gets checked,
//      even though it is not set if (cs->createIndex == 1)!
//      All the functions using this code don't initialize the variable in the original game.
#define CS_SIO_CHECK_A(resultVar, playerIndex)                                                                                             \
    if ((cs->createIndex != 0) && (cs->createIndex != 3)) {                                                                                \
        if (cs->createIndex == 1) {                                                                                                        \
            if (playerIndex == 0) {                                                                                                        \
                resultVar = sub_8024074(cs->unk4);                                                                                         \
            } else {                                                                                                                       \
                resultVar = sub_8023E04();                                                                                                 \

            cs->unk9 |= 0x10 & resultVar;                                                                                                  \
        }                                                                                                                                  \
                                                                                                                                           \
        if (resultVar < 0) {                                                                                                               \
            sub_802613C();                                                                                                                 \
            return;                                                                                                                        \
        }                                                                                                                                  \
    }

#define CS_SIO_CHECK_D(resultVar, playerIndex)                                                                                             \
    if (cs->createIndex != 0 && cs->createIndex != 3) {                                                                                    \
        if (cs->createIndex == 1) {                                                                                                        \
            if (playerIndex == 0) {                                                                                                        \
                resultVar = sub_8023EFC();                                                                                                 \
            } else {                                                                                                                       \
                resultVar = sub_80241AC(cs->unk4);                                                                                         \
            }                                                                                                                              \
            cs->unk9 |= 0x10 & resultVar;                                                                                                  \
        }                                                                                                                                  \
                                                                                                                                           \
        if (resultVar < 0) {                                                                                                               \
            sub_802613C();                                                                                                                 \
            return;                                                                                                                        \
        }                                                                                                                                  \
    }

typedef struct CharacterSelect {
    /* 0x00 */ u8 unk0;
    /* 0x01 */ u8 unk1;
    /* 0x02 */ u8 unk2;
    /* 0x03 */ u8 unk3;
    /* 0x04 */ u8 unk4;
    /* 0x05 */ u8 unk5;
    /* 0x06 */ u8 unk6;
    /* 0x07 */ u8 createIndex;
    /* 0x08 */ u8 unk8;
    /* 0x09 */ u8 unk9;
    /* 0x09 */ u8 language;
    /* 0x0B */ u8 unkB;
    /* 0x0C */ u8 unkC[2];
    /* 0x0E */ u16 unkE;
    /* 0x10 */ u16 qFadeBrightness;
    /* 0x12 */ u16 unk12;
    /* 0x14 */ u16 unk14;
    /* 0x16 */ s16 qUnk16;
    /* 0x18 */ s16 qUnk18;
    /* 0x1A */ u8 filler1A[0x2];
    /* 0x1C */ void *unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 qUnk24;
    /* 0x28 */ s32 qUnk28;
    /* 0x2C */ s32 qUnk2C;
    /* 0x30 */ s32 qUnk30;
    /* 0x34 */ s32 qUnk34;
    /* 0x38 */ s32 qUnk38;
    /* 0x3C */ s32 qUnk3C;
    /* 0x40 */ s32 qUnk40;
    /* 0x44 */ s32 qUnk44;
    /* 0x48 */ s32 qUnk48;
    /* 0x4C */ s32 qUnk4C;
    /* 0x50 */ s32 qUnk50;
    /* 0x54 */ s32 qUnk54;
    /* 0x58 */ s32 qUnk58;
    /* 0x5C */ s32 qUnk5C;
    /* 0x60 */ s32 qUnk60;
    /* 0x64 */ s32 qUnk64;
    /* 0x68 */ s32 qUnk68;
    /* 0x6C */ s32 qUnk6C;
    /* 0x70 */ s32 qUnk70;
    /* 0x74 */ Sprite spr74;
    /* 0x9C */ Sprite spr9C;
    /* 0xC4 */ Sprite sprC4;
    /* 0xEC */ Sprite sprEC;
    /* 0x114 */ Sprite spr114;
    /* 0x13C */ Sprite spr13C;
    /* 0x164 */ Sprite spr164;
    /* 0x18C */ Sprite spr18C;
    /* 0x1B4 */ Background bg1B4;
    /* 0x1F4 */ Background bg1F4;
    /* 0x234 */ Background bg234;
} CharacterSelect; /* 0x274 */

void Task_CharacterSelectInit(void);
void TaskDestructor_CharacterSelect(struct Task *t);
void sub_808723C(s16 param0, u8 param1);
void sub_8097D90(CharacterSelect *cs);
void sub_8097E5C(CharacterSelect *cs);
void sub_80986AC(CharacterSelect *cs);
bool32 sub_80988B0(CharacterSelect *cs);
bool32 sub_8098A00(CharacterSelect *cs);
bool32 sub_8098B50(CharacterSelect *cs);
bool32 sub_8098CFC(CharacterSelect *cs);
void sub_80990B0(CharacterSelect *cs);
void sub_80992A8(CharacterSelect *cs);
void sub_8099C34(CharacterSelect *cs);
void sub_809AD74(CharacterSelect *cs);
void sub_809ADF0(CharacterSelect *cs);
void sub_809AE50(CharacterSelect *cs);
void sub_809AFC0(CharacterSelect *cs);
void sub_809B13C(CharacterSelect *cs);
bool32 sub_809B148(CharacterSelect *cs);
bool32 sub_809B184(CharacterSelect *cs);
void sub_809B1E4(CharacterSelect *cs);
void sub_809B234(CharacterSelect *cs);
void sub_809B284(CharacterSelect *cs);
