#include "global.h"
#include "core.h"
#include "task.h"
#include "color.h"
#include "malloc_vram.h"
#include "module_unclear.h" // WarpToMap
#include "lib/m4a/m4a.h"
#include "game/code_1_3.h"
#include "game/main_menu.h"
#include "game/screen_fade.h"
#include "game/shared/stage/player_callbacks.h"
#include "game/save.h"
#include "game/stage.h"
#include "constants/songs.h"

typedef struct {
    /* 0x00 */ ScreenFade fade;
    /* 0x0C */ s16 levelId;
} Strc_10_8056120;

typedef struct {
    /* 0x00 */ ScreenFade fade;
    /* 0x0C */ u8 fillerC[0x28];
    /* 0x34 */ u16 unk34;
} Strc_38_8055F28;

typedef struct {
    /* 0x00 */ u8 filler0[0xC];
    /* 0x0C */ Sprite s;
    /* 0x34 */ Sprite s2;
    /* 0x5C */ u16 unk5C;
    /* 0x5E */ u8 unk5E;
    /* 0x5F */ u8 unk5F;
    /* 0x60 */ u8 unk60;
} Strc_64_8056090;

// TODO: Function unused, so this is probably a different, bigger struct.
typedef struct {
    /* 0x00 */ u8 filler0[6];
    /* 0x06 */ int_vcount winMinX;
    /* 0x07 */ int_vcount winMinY;
    /* 0x08 */ int_vcount winMaxX;
    /* 0x09 */ int_vcount winMaxY;
} Strc_sub_80561E8;

void sub_8053284(s32 unused0, s32 unused1, s32 unused2, s32 unused3);
void TaskDestructor_805332C(Task *t);
void Task_220_805374C(void);
void Task_220_8053C70(void);
void Task_220_8053DEC(void);
void Task_274_80547DC(void);
void Task_274_8054764(void);
void sub_8054514(void);
void Task_274_8054E38(void);
void Task_2A4_8054EB8(void);
void Task_2A4_8054F5C(void);
void Task_2A4_8054FE4(void);
void Task_2A4_8055048(void);
void Task_2A4_80550FC(void);
void Task_2A4_8055160(void);
void Task_2A4_80551C8(void);
void Task_2A4_805523C(void);
void Task_2A4_80552C8(void);
void Task_2A4_8055378(void);
void sub_8055614(Strc_2A4_8053284 *strc);
void Task_2A4_8055CA8(void);
void sub_2A4_8055D44(void);
void Task_10_8055DA8(void);
void sub_8055E50(Strc_64_8056090 *);
void sub_8055F28(void);
void TaskDestructor_8056104(Task *t);
void Task_274_80562BC(void);
void Task_274_8056314(void);
void Task_2A4_8056538(void);
void Task_274_8056370(void);
