#include "global.h"
#include "core.h"
#include "color.h"
#include "flags.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/main_menu.h"
#include "game/stage.h"
#include "game/save.h"
#include "game/player.h"
#include "game/player_callbacks.h"
#include "game/screen_fade.h"
#include "game/camera.h" // TODO: for CamCoord used in entities_manager.h
#include "game/shared/entities_manager.h"
#include "game/shared/rings_manager.h"
#include "module_unclear.h"

#include "constants/move_states.h"
#include "constants/songs.h"
#include "constants/zones.h"

typedef struct GameOver {
    /* 0x00 */ u16 unk0;
    /* 0x04 */ Sprite s;
    /* 0x2C */ Sprite s2;
    /* 0x54 */ ScreenFade fade;
} GameOver;

typedef struct GameOver38 {
    /* 0x00 */ u8 unk0;
    /* 0x01 */ u8 unk1;
    /* 0x02 */ u16 input;
    /* 0x04 */ ColorRaw unk4[3];
    /* 0x04 */ ColorRaw unkA[3];
    /* 0x10 */ Sprite s;
} GameOver38;

typedef struct TimeOver {
    /* 0x00 */ u16 unk0;
    /* 0x04 */ Sprite s;
    /* 0x2C */ Sprite s2;
    /* 0x54 */ ScreenFade fade;
} TimeOver;

typedef struct RectU8 {
    u8 unk0;
    u8 unk1;
    u8 unk2;
    u8 unk3;
} RectU8;

extern RectU8 gUnknown_03000970[4];

void sub_80525F0(s32, s32); /* extern */
extern ScreenFade gUnknown_030010C0;
extern u8 gUnknown_080CE548[4];
extern void *gUnknown_08E2EC78[8];
extern u16 gUnknown_080CE54C[][NUM_LANGUAGES][3];

void sub_8001D58(VoidFn proc, ColorRaw color);
void Task_60_8003FEC(void);
void TaskDestructor_8003D28(struct Task *t);
void sub_8029990(u16 song);
void Task_00_8002988();
void Task_38_8003620();
void Task_800368C();
void TaskDestructor_8003D68(struct Task *t);
void sub_8002618();
void sub_8002838(s16);
void Task_8002BBC();
void Task_8003084();
void sub_80031C8();
void Task_8003288();
void Task_80033B8();
void sub_800341C();
void sub_8003A14();
void Task_8003C38();
extern void sub_8003E44(s16);
void sub_8003F40();
void Task_8004058(void);
void sub_80040D8(s16 arg0, s16 arg1);
void Task_TimeOver_InitSprites(void);
