#include "global.h"
#include "core.h"
#include "malloc_vram.h"
#include "game/shared/stage/player.h"
#include "game/stage.h"

typedef struct ItemBox {
    /* 0x00 */ MapEntity *me;
    /* 0x04 */ u8 meX;
    /* 0x05 */ u8 id;
    /* 0x06 */ u8 meIndex;
    /* 0x07 */ u8 unk7;
    /* 0x08 */ u8 unk8;
    /* 0x09 */ u8 unk9;
    /* 0x0A */ s16 regionX;
    /* 0x0C */ s16 regionY;
    /* 0x0E */ u8 fillerE[0x2];
    /* 0x10 */ s16 unk10;
    /* 0x10 */ s16 unk12;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ Sprite s;
    /* 0x44 */ Sprite s2;
    /* 0x6C */ Player *p;
} ItemBox; /* 0x70 */

void sub_8004428(s32, s32); /* extern */
void sub_800ED50(Player *); /* extern */
void sub_80179BC(Player *); /* extern */
void sub_8017A58(Player *); /* extern */
void sub_80267E8(); /* extern */
void sub_8027538(s32); /* extern */
void sub_802773C(u16, u16); /* extern */
void sub_8027768(u32, s32); /* extern */
void sub_80277AC(u32, s32); /* extern */
void sub_80277F0(u32, s32); /* extern */
void sub_8027834(); /* extern */
void sub_805CEBC(s32, s32, s32, s32, s32, s32); /* extern */
void TaskDestructor_ItemBox(Task *); /* static */
extern u32 gUnknown_080CF3B8[2];
extern u16 gUnknown_080CF3C0[][3];
extern u16 gUnknown_080CF420[];
extern u16 gUnknown_080CF43E[];
extern u16 gUnknown_080CF44E[];

void sub_802C35C(ItemBox *itembox, s32 param1);
void sub_802C618(ItemBox *itembox);
void Task_802D61C(void);
s32 sub_802CE4C(ItemBox *itembox);
s32 sub_802D354(ItemBox *itembox, s32 arg1, s32 arg2, u8 arg3, Player *p, s32 arg5);
