#include "global.h"
#include "core.h"
#include "task.h"

#include "malloc_ewram.h"
#include "malloc_vram.h"

// TODO: Merge with below include-block
#include "game/camera.h"
#include "game/game.h"
#include "game/sa1_sa2_shared/entities_manager.h"
#include "game/stage.h"

#include "constants/zones.h"

#include "lib/m4a/m4a.h"

#if 0
#include "game/shared/stage/camera.h"
#include "game/shared/stage/entity.h"
#include "game/shared/stage/entities_manager.h"
#include "game/shared/stage/enemy_defeat_score.h"
#include "game/sa2/stage/itembox.h"

#include "game/sa2/stage/interactables/platform_thin.h"
#include "game/sa2/stage/interactables/ceiling_slope.h"
#include "game/sa2/stage/interactables/grind_rail.h"
#include "game/sa2/stage/interactables/platform_square.h"
#include "game/sa2/stage/interactables/platform.h"
#include "game/sa2/stage/interactables/ramp.h"
#include "game/sa2/stage/interactables/slidy_ice.h"
#include "game/sa2/stage/interactables/spring.h"
#include "game/sa2/stage/interactables/pipe.h"

#include "game/sa2/stage/interactables/leaf_forest/windmill.h"
#include "game/sa2/stage/interactables/leaf_forest/checkpoint.h"
#include "game/sa2/stage/interactables/leaf_forest/gapped_loop.h"
#include "game/sa2/stage/interactables/leaf_forest/stage_goal.h"
#include "game/sa2/stage/interactables/leaf_forest/corkscrew.h"
#include "game/sa2/stage/interactables/leaf_forest/corkscrew_3d.h"
#include "game/sa2/stage/interactables/leaf_forest/incline_ramp.h"

#include "game/sa2/stage/interactables/ice_paradise/funnel_sphere.h"
#include "game/sa2/stage/interactables/ice_paradise/half_pipe.h"
#include "game/sa2/stage/interactables/ice_paradise/slowing_snow.h"

#include "game/sa2/stage/interactables/sky_canyon/propeller.h"
#include "game/sa2/stage/interactables/sky_canyon/fan.h"
#include "game/sa2/stage/interactables/sky_canyon/small_windmill.h"
#include "game/sa2/stage/interactables/sky_canyon/whirlwind.h"
#include "game/sa2/stage/interactables/sky_canyon/propeller_spring.h"

#include "game/sa2/stage/interactables/techno_base/light_globe.h"
#include "game/sa2/stage/interactables/techno_base/light_bridge.h"
#include "game/sa2/stage/interactables/techno_base/arrow_platform.h"
#include "game/sa2/stage/interactables/techno_base/spike_platform.h"
#include "game/sa2/stage/interactables/techno_base/bounce_block.h"

#include "game/sa2/stage/interactables/egg_utopia/pole.h"
#include "game/sa2/stage/interactables/egg_utopia/flying_handle.h"
#include "game/sa2/stage/interactables/egg_utopia/gravity_toggle.h"
#include "game/sa2/stage/interactables/egg_utopia/cannon.h"
#include "game/sa2/stage/interactables/egg_utopia/iron_ball.h"
#include "game/sa2/stage/interactables/egg_utopia/speeding_platform.h"
#include "game/sa2/stage/interactables/egg_utopia/launcher.h"

#include "game/sa2/stage/interactables/note_particle.h"
#include "game/sa2/stage/interactables/105.h"
#include "game/sa2/stage/interactables/special_ring.h"
#include "game/sa2/stage/interactables/collect_rings_lap_trigger.h"
#include "game/sa2/stage/interactables/sky_canyon_init.h"

#include "game/sa2/stage/mystery_itembox.h"

#include "game/sa2/stage/enemies/kiki.h"
#include "game/sa2/stage/enemies/kura_kura.h"
#include "game/sa2/stage/enemies/flickey.h"
#include "game/sa2/stage/enemies/kubinaga.h"
#include "game/sa2/stage/enemies/hammerhead.h"
#include "game/sa2/stage/enemies/bullet_buzzer.h"
#include "game/sa2/stage/enemies/circus.h"
#include "game/sa2/stage/enemies/yado.h"
#include "game/sa2/stage/enemies/pen.h"
#include "game/sa2/stage/enemies/gohla.h"
#include "game/sa2/stage/enemies/bell.h"
#include "game/sa2/stage/enemies/straw.h"
#include "game/sa2/stage/enemies/kyura.h"
#include "game/sa2/stage/enemies/balloon.h"
#include "game/sa2/stage/enemies/mouse.h"
#include "game/sa2/stage/enemies/koura.h"
#include "game/sa2/stage/enemies/madillo.h"
#include "game/sa2/stage/enemies/piko_piko.h"
#include "game/sa2/stage/enemies/geji_geji.h"
#include "game/sa2/stage/enemies/star.h"
#include "game/sa2/stage/enemies/mon.h"
#include "game/sa2/stage/enemies/buzzer.h"
#include "game/sa2/stage/enemies/spinner.h"

#include "game/sa2/assets/compressed/entities.h"

#include "constants/sa2/zones.h"
#include "constants/sa2/songs.h"
#endif

#define NUM_ENEMY_DEFEAT_SCORES          5
#define READ_START_INDEX(p, hrc, rx, ry) (*((u32 *)((((u8 *)(p)) + (((hrc) * (ry)) * (sizeof(u32)))) + ((rx) * (sizeof(u32))))))

typedef struct Task *(*StagePreInitFunc)(void);
typedef void (*MapEntityInit)(MapEntity *, u16, u16, u8);

typedef struct Range {
    CamCoord xLow, yLow;
    CamCoord xHigh, yHigh;
} Range;

typedef struct EntitiesStruct {
    /* 0x00 */ u16 currentRegionX;
    /* 0x02 */ u16 currentRegionY;
    /* 0x04 */ s32 regionsX; // number of regions of current map on X-axis
    /* 0x08 */ s32 regionsY; // number of regions of current map on Y-axis
    /* 0x0C */ MapEntity *me;
    /* 0x10 */ u8 filler10[0x8];
    /* 0x18 */ s32 entityIdInRegion;
    /* 0x1C */ s32 worldX;
    /* 0x20 */ s32 worldY;
    /* 0x24 */ Range range1;
    /* 0x34 */ Range range2;

    // NOTE: These point to an offset table in the respective entity data.
    //       The offsets point to each camera region's entities block.
    //       The table size is defined by the decompressed entity data.
    //
    // TODO: Add reference to and improve this explanation!
    /* 0x44 */ u32 *enemies;
    /* 0x48 */ u32 *interactables; // aka "gimmicks"
    /* 0x4C */ u32 *items;
} EntitiesStruct; /* 0x50 */

typedef void (*EntityFunc)(MapEntity *me, u16 regionX, u16 regionY, u8 id);
extern EntityFunc gSpriteInits_Interactables[];

void Task_EntitiesManagerInit(void);
void InitEntity_Interactable(u16 param0, EntitiesStruct *es);
void sub_802BDE4(u16 param0, u16 *param1);
void sub_802BEE4(u16 param0, u16 *param1);
void sub_802BFA4(u16 param0, u16 *param1);
void SpawnMapEntities(void);

extern const RLCompressed *const gSpritePosData_interactables[NUM_LEVEL_IDS];
extern const RLCompressed *const gSpritePosData_itemboxes[NUM_LEVEL_IDS];
extern const RLCompressed *const gSpritePosData_enemies[NUM_LEVEL_IDS];
extern const RLCompressed gUnk_singlepak_rl_data[];
extern const u8 gUnknown_0203F000[];

#if 0
#ifndef COLLECT_RINGS_ROM
static void TaskDestructor_EntitiesManager(struct Task *);

const RLCompressed *const gSpritePosData_interactables[NUM_LEVEL_IDS] = {
    (void *)&zone1_act1_interactables,
    (void *)&zone1_act2_interactables,
