#include "global.h"
#include "core.h"
#include "flags.h"
#include "trig.h"
#include "module_unclear.h"
#include "code_z_1.h"
#include "malloc_ewram.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "game/camera.h"
#include "game/interactables/ice_launcher.h"
#include "game/interactables/ramp.h"
#include "game/player.h"
#include "game/player_callbacks.h"
#include "game/save.h"
#include "game/stage.h"
#include "constants/animations.h"
#include "constants/anim_commands.h" // for ANIM_CMD__PALETTE
#include "constants/move_states.h"
#include "constants/songs.h"
#include "constants/zones.h"

typedef enum ERingSpeedFactor {
    RSF_0,
    RSF_1,
    RSF_2,
    RSF_3,
    RSF_4,

    RSF_COUNT
} ERingSpeedFactor;

void sub_8003D2C(void);
void Task_80045EC(void); // -> PlayerUnkC4
void sub_8004B14();
void sub_8004BD0(Player *p, s32 arg1, s32 arg2);
void Task_8005068(void); // -> PlayerUnkC4
void Task_80050E0(void); // -> PlayerUnkC4
void sub_8005130(Player *p, s32 arg1, s32 arg2);
void sub_80051CC(Player *p, s32 arg1, s32 arg2);
void sub_80059A0(Player *, u16);
s8 sub_8005A24(Player *p, s32 unused);
u8 sub_8005B04(Player *p);
s8 sub_8005B78(Player *p);
void sub_80063B4(Player *p, s32 param1);
void sub_801300C(s16 playerId);
void sub_801310C(s16 playerId);
void sub_8013F4C(Player *p);
void sub_80141EC(Player *p, u8 param1, u8 param2);
bool16 sub_8016D88(Player *p);
void sub_80B7914(Struc_3001150 *strc);
void sub_80B794C(Struc_3001150 *strc);
bool32 sub_80B7AA4(Struc_3001150 *strc);
void sub_80B8E24(void *strc, Player *p, s32 param2, s32 param3);
void sub_8001D58(VoidFn voidFn, u16 color);
void sub_8002414();
void sub_808723C(s16 param0, u8 param1);
extern void sub_8002388(void);
void TaskDestructor_8004D2C(struct Task *t);

void Task_8010008(void);
void TaskDestructor_8010F34(struct Task *t);
void Task_8018238_30(void);
void Task_80186A0_CC(void);
void sub_8018984(void);
void Task_8018AF8(void);
void Task_801952C_2C(void);
void Task_80184F8(void);
void sub_8018C6C(void);
void sub_8018814(void);
void sub_8018DDC(void);
void sub_80190C8(void);
void sub_8019150(void);
void Task_80191C8(void);
void Task_TagActionInit(void);
void Task_8019628(void);
void Task_AfterImages();
void sub_8019A7C();
void RetrieveInitialAnimationPalette(u16 animId, u16 insertOffset);
void Player_InitializeAfterImagesTask(Player *p);
void TaskDestructor_AfterImages(Task *t);
void TaskDestructor_80194B4(Task *t);
void sub_80194DC(Task *t);
void sub_801957C(void);

void TaskDestructor_8019318(struct Task *t);
void TaskDestructor_801932C(struct Task *t);
void TaskDestructor_8019340(struct Task *t);
void TaskDestructor_8019354(struct Task *t);
void TaskDestructor_8019368(struct Task *t);
void TaskDestructor_8019390(struct Task *t);
void TaskDestructor_TagAction(struct Task *t);
void TaskDestructor_80193EC(struct Task *t);
void TaskDestructor_8019400(Task *t);
void TaskDestructor_8019428(struct Task *t);
void TaskDestructor_801948C(struct Task *t);
void TaskDestructor_80194B4(struct Task *t);
void TaskDestructor_80194C8(struct Task *t);
void TaskDestructor_8019504(struct Task *t);

void sub_801320C(Player *p, PlayerSpriteInfo *spriteInfoBody);
void sub_80136DC(s16 param0);
void sub_8013A68(s16 param0);
bool16 sub_8014A60(Player *p);
bool16 sub_8014D70(Player *p);
s16 sub_8015064(Player *p);
bool32 sub_8015568(Player *p);
bool16 sub_8016EDC(Player *p);
bool32 sub_8017058(Player *p);
extern void Task_8019240(void);
void Task_80182D4(void);
void Task_801839C_E0(void);
void Task_8018550(void);
void sub_801862C(void);
void TaskDestructor_80194A0(struct Task *t);
void Task_8019698(void);
void sub_8019CF0(Player *p);
void sub_801A224(Player *p);
void sub_801D5CC(Player *p);
void sub_801DAD8(Player *p);
void sub_801EBC0(s32, Player *p);
void sub_8023634();
void sub_8026254(Player *p);
void sub_80268B8(s16);
void sub_8027878(u8);
void sub_80278DC(void);

void sub_80B7968(Struc_3001150 *, Player *);
u16 sub_80B7A94(Struc_3001150 *);

extern void sub_8002508(void);
extern void sub_802785C(void);
extern void sub_8056120(s16 param0);
extern void sub_8056168(void);

bool32 sub_8010184(Sprite *s, s32 offsetX, s32 offsetY, s16 hbIndex, Player *p);

typedef struct {
    AnimId anim;
    u16 variant;
} TileInfoShield;

typedef struct Strc_800FF68 {
    /* 0x00 */ s32 qWorldX;
    /* 0x04 */ s32 qWorldY;
    /* 0x08 */ s16 unk8;
    /* 0x0A */ u16 unkA;
    /* 0x0C */ u8 fillerC[0x4];
    /* 0x10 */ Player *p;
    /* 0x14 */ Sprite s;
} Strc_800FF68; /* size: 0x3C */

typedef struct Strc_PlayerStrc2C {
    /* 0x00 */ Sprite s;
    /* 0x28 */ s16 unk28;
    /* 0x2A */ s16 unk2A;
} Strc_PlayerStrc2C; /* 0x2C */

typedef struct Strc_PlayerStrc2C_2 {
    /* 0x00 */ Sprite s;
    /* 0x28 */ Player *p;
} Strc_PlayerStrc2C_2; /* 0x2C */

// NOTE/TODO: It's possible every single Strc_PlayerStrc30 task creates its own version
//            of the struct, with different layouts.
typedef struct Strc_PlayerStrc30 {
    /* 0x00 */ Sprite s;
    /* 0x28 */ Player *p;
    /* 0x2C */ s16 someY;
} Strc_PlayerStrc30; /* 0x30 */

typedef struct Strc_PlayerStrc30_2 {
    /* 0x00 */ Sprite s;
    /* 0x2C */ s16 someY;
    /* 0x28 */ Player *p;
} Strc_PlayerStrc30_2; /* 0x30 */

typedef struct Strc_PlayerStrc50 {
    /* 0x00 */ Sprite s;
    /* 0x28 */ Player *p;
    /* 0x2C */ s8 unk2C;
    /* 0x2D */ s8 unk2D;
    /* 0x2E */ s16 unk2E[8][2];
} Strc_PlayerStrc50;

typedef struct PlayerStrcCC_Sprite {
    Sprite s;
    u8 unk28;
    u8 filler29[0x1];
    s16 worldX;
    s16 worldY;
    u8 filler2E[0x2];
} PlayerStrcCC_Sprite;

typedef struct Strc_PlayerStrcCC {
    /* 0x00 */ u8 *vram;
    /* 0x04 */ s16 unk4;
    /* 0x06 */ s16 unk6;
    /* 0x08 */ Player *p;
    /* 0x0C */ PlayerStrcCC_Sprite sprites[4];
    /* 0xA8 */
} Strc_PlayerStrcCC;

typedef struct Strc_PlayerUnkE0 {
    /* 0x00 */ void *vram;
    /* 0x04 */ Sprite s;
    /* 0x2C */ Sprite s2;
    /* 0x54 */ Vec2_16 unk54[10];
    /* 0x7C */ s16 unk7C;
    /* 0x7E */ s16 unk7E;
    /* 0x84 */ s16 unk80[12][2];
    /* 0xB4 */ s16 unkB0[12][2];
} Strc_PlayerUnkE0;

typedef struct AfterImages {
    /* 0x00 */ SpriteTransform tf;
    /* 0x0C */ Sprite2 s;
    /* 0x3C */ u8 unk3C;
    /* 0x3C */ u8 filler3D[3];
} AfterImages;

typedef struct SomeSubStruct_3001BF0 {
    /* 0x00 */ s32 qWorldX;
    /* 0x04 */ s32 qWorldY;
    /* 0x08 */ u32 frameFlags;
    /* 0x0C */ u32 moveState;
    /* 0x10 */ s16 anim2;
    /* 0x12 */ s16 rotation;
    /* 0x14 */ s8 state1;
    /* 0x15 */ s8 animSpeed;
} SomeSubStruct_3001BF0; /* size: 0x18 */
typedef struct Strc_03001BF0 {
    SomeSubStruct_3001BF0 unk0[8];
    Player *unkC0;
    u8 index;
} Strc_03001BF0;

extern Strc_03001BF0 gUnknown_03001BF0;
extern u16 gUnknown_080CE7E2[][2];

typedef struct Strc_03001CF0 {
    u8 unk0;
    u8 filler1[3];
    u8 unk4;
    u16 unk6;
} Strc_03001CF0;

extern Strc_03001CF0 gUnknown_03001CF0;

extern u16 gMedalTimes[][2];
extern u8 gUnknown_080CF468[];
extern s16 gUnknown_080CF470[][2];
extern s16 gUnknown_080CE5B8[9]; // Spindash accel related
extern u16 gCharVoicesLifeLost[NUM_CHARACTERS];
extern u16 gUnknown_080CE5CA[10];
extern u16 gUnknown_080CE5E8[NUM_CHARACTERS];
extern s16 gUnknown_080CE5F2[5];
extern s16 gUnknown_080CE5FC[8];
extern u16 gUnknown_080CE60C[8];
extern s16 gUnknown_080CE61C[8][2];
extern s16 gUnknown_080CE63C[4];
extern s32 gUnknown_080CE644[25];
extern s16 gUnknown_080CE6A8[4][2];
extern s16 gUnknown_080CE6B8[RSF_COUNT][2];
