#include "global.h"
#include "core.h"
//#include "code_0_1.h" // WarpToMap (see comment below)
#include "game/save.h"
#include "game/screen_fade.h"
#include "game/stage.h"

#if 0
s16 sa3__sub_80B1560(? (**)(s16, s16 *), u16);      /* extern */
? sub_800341C();                                    /* extern */
? sub_808ADF0(s32);                                 /* extern */
? sub_80AB120(s32);                                 /* extern */
? sub_80BE46C(s32);                                 /* extern */
void TaskDestructor_80B2224(Task *);                /* static */
void TaskDestructor_SpStage288(Task *);                /* static */
void Task_80B2228();                                /* static */
void Task_80B2358();                                /* static */
void Task_80B3080();                                /* static */
void Task_80B3648();                                /* static */
void Task_80B494C();                                /* static */
void Task_80B5038();                                /* static */
void Task_80B6D78();                                /* static */
void Task_80B7314();                                /* static */
void Task_80B7470();                                /* static */
void Task_80B75A0();                                /* static */
void sub_80B1DA0();                                 /* static */
void sub_80B1E34();                                 /* static */
void sub_80B1EC8();                                 /* static */

        temp_r1 = 7 - var_r4;
        (&subroutine_arg0)[var_r4] = (s16) ((s32) (temp_r1 * gSineTable[(temp_r5 + (var_r4 * 0x92)) & 0x3FF]) >> 9);
        ((var_r4 * 2) + sp)->unk18 = (s16) ((s32) (temp_r1 * gSineTable[((temp_r5 + (var_r4 * 0x46)) & 0x3FF) + 0x100]) >> 9);
        var_r4 += 1;
    } while ((u32) var_r4 <= 6U);
    temp_r4_2 = (u16) sa3__sub_80B1560(&subroutine_arg0, (u16) sp34);
    temp_r2 = ((var_r6 * 0x91) + (sp3C >> 0x10)) & 0x3FF;
    temp_r2_2 = (s16) (((s32) ((sa3__sub_80B1560(&sp18, (u16) sp34) << 0x10) + 0x5D0000) >> 0x10) - ((s32) (gSineTable[temp_r2 + 0x100] * 5) >> 0xB)) + (sp40 >> 0x10);
    if (((s32) temp_sb->unk27F >> var_r6) & 1) {
        var_r6_2 = temp_sb + ((var_r6 * 0x28) + 0x13C);
    } else {
        var_r6_2 = temp_sb + 0x254;
    }
    var_r6_2->x = ((s32) ((temp_r4_2 << 0x10) + 0x6C0000) >> 0x10) + ((s32) (gSineTable[temp_r2] * 5) >> 0xB);
    var_r6_2->y = temp_r2_2;
    DisplaySprite(var_r6_2);
    var_r6 = (u8) sp38;
    if ((u32) var_r6 <= 6U) {
        goto loop_11;
    }
}

void Task_80B7314(void) {
    s32 var_r0;
    u16 *temp_r1;
    u16 temp_r2;
    u8 temp_r0;
    void *temp_r4;

    temp_r2 = gCurTask->data;
    temp_r4 = temp_r2 + 0x03000000;
    if (gStageData.unkD == 0) {
        temp_r0 = temp_r2->unk3000281;
        if (temp_r0 != 0) {
            temp_r2->unk3000281 = (u8) (temp_r0 - 1);
            if (temp_r2->unk300027E != 0) {
                temp_r2->unk300005C = (u16) (temp_r2->unk300005C - 0x10);
                var_r0 = 0x03000084;
            } else {
                var_r0 = 0x030000AC;
            }
            temp_r1 = temp_r2 + var_r0;
            *temp_r1 -= 0x10;
        }
    }
    temp_r4->unk284 = (u16) (temp_r4->unk284 + 0x80);
    sub_80B7074();
    if ((s32) (s16) temp_r4->unk284 < 0) {
        gCurTask->main = sub_80B73A4;
    }
}

void sub_80B73A4(void) {
    s16 var_r0;
    u16 temp_r6;
    u8 temp_r1;
    void *temp_r4;

    temp_r6 = gCurTask->data;
    temp_r4 = temp_r6 + 0x03000000;
    temp_r6->unk3000284 = (u16) (temp_r6->unk3000284 + 0x80);
    sub_80B7074();
    if ((gStageData.unkD == 0) || ((0x7F & temp_r6->unk300027F) == 0x7F)) {
        temp_r1 = temp_r6->unk3000280;
        temp_r6->unk3000280 = (u8) (temp_r1 + 1);
        if ((u32) temp_r1 > 0x78U) {
            temp_r6->unk3000000 = 1;
            temp_r4->unk2 = 1;
            temp_r4->unk4 = 0;
            var_r0 = 0x40;
            goto block_6;
        }
    } else {
        if (1 & gPressedKeys) {
            m4aSongNumStart(0x6AU);
            temp_r6->unk3000000 = 1;
            temp_r4->unk2 = 1;
            temp_r4->unk4 = 0;
            var_r0 = 0x100;
block_6:
            temp_r4->unk6 = var_r0;
            temp_r4->unkA = 0;
            temp_r4->unk8 = 0xBF;
            gCurTask->main = Task_80B75A0;
            return;
        }
        if (0x30 & gPressedKeys) {
            temp_r6->unk3000282 = (u8) (temp_r6->unk3000282 ^ 1);
            m4aSongNumStart(0x6CU);
        }
    }
}
#endif

// 0x288U
typedef struct {
    /* 0x000 */ ScreenFade fade0;
    /* 0x00C */ u8 fillerC[0x272];
    /* 0x27E */ u8 unk27E;
    /* 0x27F */ u8 unk27F;
    /* 0x280 */ u8 filler280[0x2];
    /* 0x282 */ u8 unk282;
    /* 0x283 */ u8 unk283;
    /* 0x284 */ u16 unk284;
} SpStage288;

extern void sub_80AB120(u8 param0);
extern void sub_808ADF0(u8 param0);
extern void sub_80B1AF4(u16 param0, u16 param1, u8 param2);
extern void sub_80B7074(void);
extern void Task_80B7470(void);
/* TODO: WarpToMap needs to be declared like this for the call in Task_80B7470() to match to match:
 * 'void WarpToMap(s32 level, s16 warpId);'
 * but level is s16 in the implementation and most other calls... */
extern void WarpToMap(s32 level, s16 warpId);
// declare sub_8001E58() here because of the WarpToMap issue
void sub_8001E58(void);

void Task_80B7470(void)
{
    SpStage288 *temp_r4 = TASK_DATA(gCurTask);
    s32 var_r5 = 0;

    if (gStageData.unkD == 0) {
        if (temp_r4->unk27E != 0) {
            if (((0x7F & temp_r4->unk27F) == 0x7F) && !(4 & LOADED_SAVE->unlockFlags)) {
                var_r5 = 1;
                LOADED_SAVE->unlockFlags |= 4;
            }
            LOADED_SAVE->collectedEmeralds = temp_r4->unk27F;
