#include <string.h> // memcpy
#include "global.h"
#include "core.h"
#include "flags.h"
#include "module_unclear.h"
#include "malloc_vram.h"
#include "game/camera.h"
#include "game/entity.h"
#include "game/player.h"
#include "game/player_callbacks.h"
#include "game/stage.h"
#include "game/screen_fade.h"

#include "constants/animations.h"
#include "constants/anim_sizes.h"
#include "constants/move_states.h"
#include "constants/songs.h"
#include "constants/zones.h"

#define NUM_SWITCHES 5

typedef struct {
    /* 0x00 */ u32 unk0;
    /* 0x04 */ u8 unk4;
    /* 0x05 */ u8 filler5[0xF];
    /* 0x14 */ Sprite s;
} CapSwitch; /* 0x3C */

typedef struct {
    /* 0x000 */ SpriteBase base;
    /* 0x00C */ u8 unkC;
    /* 0x00D */ u8 unkD;
    /* 0x00E */ u8 unkE;
    /* 0x00F */ u8 unkF;
    /* 0x010 */ s8 unk10; // score
    /* 0x011 */ s8 unk11;
    /* 0x012 */ u8 unk12;
    /* 0x013 */ u8 unk13;
    /* 0x014 */ u8 unk14;
    /* 0x015 */ u8 unk15;
    /* 0x016 */ s16 timer;
    /* 0x018 */ s16 unk18;
    /* 0x01C */ Vec2_32 playerPos[NUM_SINGLE_PLAYER_CHARS]; // TODO: Not a pos?
    /* 0x02C */ u16 unk2C;
    /* 0x02E */ u16 unk2E;
    /* 0x030 */ s16 qUnk30[2][2];
    /* 0x038 */ s32 qUnk38[2][2];
    /* 0x048 */ u8 filler48[0x60];
    /* 0x0A8 */ void *unkA8;
    /* 0x0AC */ void *unkAC;
    /* 0x0B0 */ Sprite s;
    /* 0x0D8 */ u8 fillerD8[0x14];
    /* 0x0EC */ CapSwitch switches[NUM_SWITCHES];
    /* 0x218 */ Sprite sprTimer[21];
    /* 0x560 */ Sprite s2;
    /* 0x588 */ Sprite s3;
    /* 0x5B0 */ Sprite spr5B0[3];
    /* 0x628 */ Sprite spr628[5]; // Switches?
    /* 0x6F0 */ ScreenFade fade;
    /* 0x6FC */ s32 random;
} Capsule; /* 0x700 */

s32 sub_803C094(Sprite *s, u8 param1, s32 worldX, s32 worldY);
void Task_BonusCapsuleMain(void);
void Task_8039DC0(void);
void sub_803A3B4(s16);
void Task_803A5D4(void);
void Task_803A6DC(void);
void Task_803A8A8(void);
void Task_803A978(void);
void sub_803AAE8(Capsule *cap, Player *p, u8 param2);
u32 sub_803B070(Capsule *cap);
void sub_803B1A4(Capsule *cap);
void sub_803B23C(Sprite *s);
void sub_803B288(void);
void sub_803B354(void);
void sub_803B498(void);
void sub_803B6E8(Capsule *cap, s16 worldX, s16 worldY);
void sub_803B804(void);
void sub_803B910(void);
void sub_803BB60(void);
void sub_803BC0C(void);
void sub_803BDA0(void);
void sub_803BE48(void);
void sub_803BE9C(Sprite *s);
void sub_803BEE0(Sprite *s);
void sub_803BF78(u32 param0);
void sub_803BFC4(Capsule *cap);
void sub_803C010(u32 param0);
void sub_803BC80(s16 param0, s16 param1, u8 param2);
void TaskDestructor_BonusCapsule(struct Task *);
