#include <string.h> // memcpy
#include "global.h"
#include "core.h"
#include "flags.h"
#include "module_unclear.h"
#include "malloc_vram.h"
#include "game/camera.h"
#include "game/entity.h"
#include "game/player.h"
#include "game/player_callbacks.h"
#include "game/stage.h"
#include "game/screen_fade.h"
#include "game/interactables/bonus_game_ui.h"

#include "constants/animations.h"
#include "constants/anim_sizes.h"
#include "constants/move_states.h"
#include "constants/songs.h"
#include "constants/zones.h"

#define NUM_DEFEATABLE_ENEMIES 8
#define SIZEOF_BAR_FRAME       (MAX_TILES(ANIM_BONUS_UI_BAR) * TILE_SIZE_4BPP)
#define BAR_WIDTH              (NUM_DEFEATABLE_ENEMIES * ANIM_BONUS_UI_BAR_WIDTH)
// NOTE: Technically this is offset by (ANIM_BONUS_UI_BAR_WIDTH / 2)
#define FIRST_ELEM_X (((DISPLAY_WIDTH / 2) - (BAR_WIDTH / 2)) + ANIM_BONUS_UI_BAR_WIDTH)

#define LIFE_ICON_P1_X      95
#define LIFE_ICON_P1_Y      78
#define LIFE_ICON_P2_X      105
#define LIFE_ICON_P2_Y      78
#define LIFE_BACKDROP_X     108
#define LIFE_BACKDROP_Y     85
#define EXTRALIFE_COUNTER_X 150
#define EXTRALIFE_COUNTER_Y 85
#define LIFE_COUNT_X_X      138
#define LIFE_COUNT_X_Y      86
#define COUNTDOWN_DIGIT_X   (DISPLAY_WIDTH / 2)
#define COUNTDOWN_DIGIT_Y   (DISPLAY_HEIGHT / 2)

typedef struct {
    /* 0x00 */ Sprite s;
    /* 0x28 */ s32 qUnk28;
    /* 0x2C */ s32 qUnk2C;
    /* 0x30 */ s16 unk30;
    /* 0x32 */ s16 unk32;
    /* 0x34 */ u8 unk34;
} BonusFlower;

typedef struct {
    /* 0x000 */ SpriteBase base;
    /* 0x00C */ u8 unkC[4];
    /* 0x010 */ s16 timer;
    /* 0x012 */ s16 unk12;
    /* 0x014 */ u8 unk14;
    /* 0x015 */ u8 unk15;
    /* 0x016 */ s8 unk16;
    /* 0x017 */ u8 unk17;
    /* 0x018 */ Sprite sprTimer[21];
    /* 0x360 */ Sprite sprCountdownDigit;
    /* 0x388 */ Sprite sprKillBar[NUM_DEFEATABLE_ENEMIES];
    /* 0x4C8 */ Sprite sprPlayer1Icon;
    /* 0x4F0 */ Sprite sprPlayer2Icon;
    /* 0x518 */ Sprite spr518;
    /* 0x540 */ Sprite spr540;
    /* 0x568 */ Sprite spr568;
    /* 0x590 */ ScreenFade fade;
} BonusGameUI;

void Task_BonusGameUIInit(void);
void TaskDestructor_BonusGameUI(struct Task *);
void Task_BonusFlower_803C4A0(void);
void sub_803C6F4(s16);
void Task_803C898(void);
void Task_803CA28(void);
void Task_803CF84(void);
void Task_803D248(void);
void Task_803D324(void);
void Task_803D39C(void);
void InitCountdownDigitSprite(Sprite *s);
void sub_803D4C8(void);
void sub_803D614(void);
void Task_803D750(void);
void sub_803D784(bool32 param0);

// TODO: Merge ia_bonus_capsule and bonus_game_UI?
extern void sub_8039D60(Sprite *, u8 i, void *tiles);

// const TileInfo gUnknown_080CF770[7] = {
//     [0] = {ANIM_BONUS_STATUS_TEXT, 0},
//     [1] = {ANIM_BONUS_STATUS_TEXT, 1},
//     [2] = {ANIM_BONUS_STATUS_TEXT, 2},
//     [3] = {ANIM_BONUS_STATUS_TEXT, 3},
//     [4] = {ANIM_BONUS_COUNTDOWN_DIGIT, 0},
//     [5] = {ANIM_BONUS_COUNTDOWN_DIGIT, 1},
//     [6] = {ANIM_BONUS_COUNTDOWN_DIGIT, 2},
// };
extern const TileInfo gUnknown_080CF770[7];
