#include "global.h"
#include "core.h"
#include "trig.h"
#include "malloc_vram.h"
#include "multi_sio_stuff.h"
#include "lib/m4a/m4a.h"
#include "game/save.h"
#include "game/stage.h"
#include "game/sa3/bosses/more_gemerl.h"
#include "game/shared/stage/music_manager.h"
#include "game/shared/stage/player_callbacks.h"
#include "game/shared/stage/terrain_collision.h"
#include "game/interactables/blue_red_button.h"
#include "constants/animations.h"
#include "constants/interactables.h"
#include "constants/songs.h"

typedef struct {
    /* 0x0C */ s32 unk0;
    /* 0x0C */ s32 unk4;
    /* 0x0C */ s32 unk8;
    /* 0x0C */ s32 unkC;
    /* 0x10 */ u8 *unk10;
    /* 0x14 */ u8 unk14;
    /* 0x15 */ s8 unk15;
    /* 0x16 */ s8 unk16;
    /* 0x17 */ u8 unk17;
    /* 0x18 */ s8 unk18;
    /* 0x19 */ s8 unk19;
    /* 0x1A */ s8 unk1A;
    /* 0x1B */ s8 unk1B;
    /* 0x1C */ s8 unk1C;
    /* 0x1D */ u8 unk1D;
    /* 0x1E */ u8 unk1E;
    /* 0x1F */ u8 unk1F;
    /* 0x20 */ u8 unk20;
    /* 0x21 */ u8 unk21;
    /* 0x22 */ u8 unk22;
    /* 0x23 */ s8 unk23;
    /* 0x24 */ s8 unk24;
    /* 0x25 */ u8 unk25;
    /* 0x26 */ s8 unk26;
    /* 0x27 */ s8 unk27;
    /* 0x28 */ s16 unk28;
    /* 0x2A */ u16 unk2A;
    /* 0x2C */ u16 unk2C;
    /* 0x2E */ u16 unk2E;
    /* 0x30 */ u16 unk30;
    /* 0x34 */ u8 *vram34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ s32 unk3C;
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ Vec2_32 unk48;
    /* 0x50 */ Player *player;
    /* 0x54 */ Player *partner;
    /* 0x58 */ MapEntity me;
    /* 0x60 */ SpriteTransform tf;
    /* 0x6C */ Sprite sprBody;
    /* 0x94 */ Sprite2 sprEggman;
    /* 0xC4 */ Sprite sprExplosion;
    /* 0xEC */ u8 fillerEC[0x10];
    /* 0xC4 */ Sprite sprFC;
} EggWheeler; /* 0x124 */

typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ u8 unk8;
    /* 0x09 */ u8 playerIndex;
    /* 0x0A */ u8 unkA;
    /* 0x0B */ u8 unkB;
    /* 0x0C */ u16 unkC;
    /* 0x0E */ u16 unkE;
    /* 0x10 */ s32 unk10;
    /* 0x10 */ s32 unk14;
    /* 0x10 */ s32 unk18;
    /* 0x1C */ Sprite *s;
    /* 0x20 */ u8 unk20[8];
} Strc_806CAA4;

typedef struct {
    /* 0x00 */ u8 *data;
    /* 0x04 */ s32 dx;
    /* 0x08 */ s32 unk8;
    /* 0x0C */ s32 unkC;
    /* 0x10 */ Sprite2 s;
} Boss2Entrance;

typedef struct {
    /* 0x00 */ u8 *data;
    /* 0x04 */ s32 dx;
    /* 0x08 */ s32 unk8;
    /* 0x0C */ s32 unkC;
    /* 0x10 */ Sprite2 s;
} Boss2Exit;

void Task_Boss2Entrance(void);
void TaskDestructor_Boss2Entrance(struct Task *t);

void Task_Boss2Init(void);
void Boss2_TransitionToIntro(void);
void Task_806AC7C(void);
void Task_806AD04(void);
void Task_806ADDC(void);
void Task_806AEDC(void);
void Task_CreatePlatformButton(void);
void TaskDestructor_Boss2(struct Task *t);
void Task_Boss2ExitInit(void);
void TaskDestructor_Boss2Exit(struct Task *);
void sub_806AA40(EggWheeler *boss);
void sub_806AAA4(EggWheeler *boss);
u8 sub_806B094(EggWheeler *boss);
bool32 sub_806B844(EggWheeler *boss);
AnimCmdResult sub_806BC50(EggWheeler *boss);
void sub_806BE5C(void);
void sub_806C12C(void);
void sub_806C1C8(void);
void sub_806CA28(EggWheeler *boss);
void sub_806CCB0(Player *);
void sub_806CEE8(EggWheeler *boss);
void sub_806D01C(EggWheeler *boss);
void sub_806D07C(EggWheeler *boss);
void CreateBoss2Entrance(u8 *out, u8 *vram);
s32 sub_806B6C8(EggWheeler *boss);
void CreateBoss2Exit(u8 *out, u8 *vram);
