#include "global.h"
#include "core.h"
#include "trig.h"
#include "malloc_vram.h"
#include "multi_sio_stuff.h"
#include "lib/m4a/m4a.h"
#include "game/bosses.h"
#include "game/shared/stage/screen_shake.h"
#include "game/shared/stage/music_manager.h"
#include "game/shared/stage/player.h"
#include "game/sa3/bosses/more_gemerl.h"
#include "game/save.h"
#include "game/stage.h"
#include "constants/animations.h"
#include "constants/move_states.h"
#include "constants/songs.h"

#define SPRITE_ARR_1_COUNT 16
#define SPRITE_ARR_2_COUNT 11

typedef struct {
    s32 unk0;
    u8 unk4;
    u8 unk5;
} EggFoot_3C8;

typedef struct {
    s32 x;
    s32 y;
    Sprite2 s;
} ExtSprite;

typedef struct {
    /* 0x00 */ AnimId anim;
    /* 0x02 */ u8 pattern;
    /* 0x03 */ u8 unk3;
    /* 0x04 */ u8 unk4;
    /* 0x05 */ u8 unk5;
    /* 0x06 */ u8 unk6;
    /* 0x07 */ u8 unk7;
} Strc_80D57CC;

typedef struct {
    /* 0x000 */ s32 unk0;
    /* 0x000 */ s32 unk4;
    /* 0x000 */ s32 unk8;
    /* 0x000 */ s32 unkC;
    /* 0x010 */ s32 unk10;
    /* 0x014 */ s32 unk14;
    /* 0x018 */ s32 unk18;
    /* 0x01C */ s32 unk1C;
    /* 0x020 */ u16 unk20;
    /* 0x020 */ u16 unk22;
    /* 0x024 */ u8 unk24[8];
    /* 0x02C */ u8 *bossPhase;
    /* 0x030 */ u8 lives;
    /* 0x031 */ u8 unk31;
    /* 0x032 */ s16 unk32;
    /* 0x034 */ u16 unk34;
    /* 0x036 */ s16 unk36;
    /* 0x038 */ u8 *vram38; // 124 tiles
    /* 0x03C */ u8 *vram3C; // 116 tiles
    /* 0x040 */ Player *players[NUM_SINGLE_PLAYER_CHARS];
    /* 0x048 */ ExtSprite sprites48[SPRITE_ARR_1_COUNT];
    /* 0x3C8 */ EggFoot_3C8 unk3C8[2][SPRITE_ARR_2_COUNT];
    /* 0x478 */ ExtSprite sprites478[SPRITE_ARR_2_COUNT];
} EggFoot;

void sub_806D404(EggFoot *boss);
void sub_806D568(EggFoot *boss);
void sub_806D6C4(EggFoot *boss);
void sub_806DA20(EggFoot *boss);
void sub_806DB78(EggFoot *boss);
void sub_806DD34(EggFoot *boss);
void sub_806DED8(EggFoot *boss);
void sub_806E330(EggFoot *boss);
void sub_806EAA0(EggFoot *boss);

void Task_EggFootInit(void);
void Task_806D268(void);
void sub_806D388(void);
bool8 sub_806D840(EggFoot *arg0, u8 pid);
void sub_806D808(EggFoot *arg0, u8 pattern);
void Task_806E950(void);
void sub_806E99C(void);
void sub_806E9C0(void);
void Task_806E9F0(void);
void sub_807A37C(void);
void TaskDestructor_EggFoot(struct Task *t);
void sub_8078E34(s32 *sp0, VoidFn func);

extern s32 sub_807A1DC(Sprite *);

const Strc_80D57CC gUnknown_080D57CC[SPRITE_ARR_1_COUNT] = {
    [0] = { ANIM_BOSS_3_COCKPIT, 0x00, 0x13, 0x01, 0x00, 0x40, 0x00 }, //
    [1] = { ANIM_BOSS_3_EGGMAN, 0x00, 0x12, 0x01, 0x00, 0x08, 0x00 }, //
