#include "global.h"
#include "core.h"
#include "trig.h"
#include "multi_sio_stuff.h"
#include "lib/m4a/m4a.h"
#include "malloc_vram.h"
#include "game/bosses.h"
#include "game/stage.h"
#include "game/shared/stage/player_callbacks.h"
#include "game/shared/stage/screen_shake.h"
#include "game/shared/stage/terrain_collision.h"
#include "game/sa3/bosses/more_gemerl.h"
#include "game/shared/stage/music_manager.h"
#include "game/shared/stage/player.h"
#include "constants/animations.h"
#include "constants/move_states.h"
#include "constants/songs.h"

#define CONFETTI_SPRITE_COUNT    8u
#define CONFETTI_POSITIONS_COUNT 24u

typedef struct {
    /* 0x000 */ s32 qWorldX;
    /* 0x004 */ s32 qWorldY;
    /* 0x008 */ s32 unk8;
    /* 0x00C */ s32 unkC;
    /* 0x010 */ u16 unk10;
    /* 0x012 */ u8 unk12;
    /* 0x013 */ u8 unk13;
    /* 0x014 */ u8 *bossPhase;
    /* 0x018 */ u8 unk18;
    /* 0x019 */ s8 unk19;
    /* 0x01A */ u8 unk1A;
    /* 0x01B */ u8 unk1B;
    /* 0x01C */ u8 unk1C;
    /* 0x01D */ u8 unk1D;
    /* 0x01E */ u16 unk1E;
    /* 0x020 */ s16 unk20;
    /* 0x022 */ u16 unk22;
    /* 0x024 */ u16 unk24;
    /* 0x026 */ s16 unk26;
    /* 0x028 */ s16 unk28;
    /* 0x02A */ s16 unk2A;
    /* 0x02C */ u16 unk2C;
    /* 0x02E */ s16 unk2E;
    /* 0x030 */ s16 unk30;
    /* 0x032 */ u8 unk32;
    /* 0x033 */ u8 unk33;
    /* 0x033 */ u8 *vram34;
    /* 0x038 */ u8 *vram38;
    /* 0x03C */ u8 *vram3C;
    /* 0x040 */ Player *players[2];
    /* 0x048 */ Sprite spr48;
    /* 0x070 */ Sprite spr70;
    /* 0x098 */ s32 unk98;
    /* 0x09C */ s32 unk9C;
    /* 0x0A0 */ s32 unkA0;
    /* 0x0A4 */ s32 unkA4;
    /* 0x0A8 */ s32 unkA8;
    /* 0x0AC */ s32 unkAC;
    /* 0x0B0 */ s32 unkB0;
    /* 0x0B4 */ s32 unkB4;
    /* 0x0B8 */ s32 unkB8;
    /* 0x0BC */ s32 unkBC;
    /* 0x0C0 */ u8 fillerC0[0x8];
    /* 0x0C8 */ u8 *vramC8;
    /* 0x0CC */ u8 *vramCC;
    /* 0x0D0 */ Sprite sprD0;
    /* 0x0F8 */ SpriteTransform tf0F8;
    /* 0x104 */ Sprite spr104;
    /* 0x0F8 */ SpriteTransform tf12C;
    /* 0x138 */ Sprite spr138;
    /* 0x138 */ Sprite spr160;
} EggCube; /* 0x188 */

typedef struct {
    /* 0x00 */ EggCube *boss;
    /* 0x04 */ Sprite s;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s16 unk34;
    /* 0x36 */ s16 unk36;
    /* 0x38 */ u8 unk38;
    /* 0x39 */ u8 unk39;
    /* 0x3A */ u8 filler3a[2];
} EggCubeGuard;

typedef struct {
    /* 0x000 */ u8 filler0[8];
    /* 0x008 */ Sprite sprites8[8];
    /* 0x148 */ s32 qWorldPos[24 * 2];
    /* 0x268 */ s16 qVelocities[24 * 2];
    /* 0x268 */ u8 unk268;
} EggCubeConfetti; /* 0x26C */

void Task_EggCubeInit(void);
void Task_EggCube_806ED00(void);
void Task_EggCube_806EDE8(void);
void Task_EggCube_806EEB8(void);
void sub_806EFE8(EggCube *boss);
bool32 sub_806F5F0(Player *p);
void Task_EggCube_806F3A0(void);
void sub_806F2B8(EggCube *boss);
void sub_806FA0C(EggCube *boss);
void sub_806FAFC(EggCube *boss, u8 param1);
void Task_Guard_806FC2C(void);
void sub_806FE98(EggCube *boss);
void SpawnGuardEnemy(EggCube *boss, u8 param1);
void Task_26C_806FFCC(void);
void sub_8070138(EggCube *boss);
void sub_8070208(EggCube *boss);
void sub_8070370(EggCube *boss);
void sub_8071410(EggCube *boss);
void sub_8071664(void);
void sub_8071904(EggCube *boss, u16 param1);
void sub_8071968(EggCube *boss, u8 param1);
void sub_80719B4(EggCube *boss);
void sub_80719C8(EggCube *boss);
void sub_8071720(EggCube *boss);
void sub_8071764(EggCube *boss);
void sub_80717A8(EggCube *boss);
void sub_806F56C(void);
void sub_807A37C(void);
