#include "global.h"
#include "core.h"
#include "trig.h"
#include "malloc_vram.h"
#include "lib/m4a/m4a.h"
#include "multi_sio_stuff.h"
#include "game/game.h"
#include "game/bosses.h"
#include "game/save.h"
#include "game/sa3/bosses/more_gemerl.h"
#include "game/stage.h"
#include "game/shared/stage/player.h"
#include "game/shared/stage/player_callbacks.h"
#include "game/shared/stage/screen_shake.h"
#include "constants/animations.h"
#include "constants/move_states.h"
#include "constants/songs.h"

#define GEMERL_TURN_MIN_X 1696
#define GEMERL_TURN_MAX_X 1760

#define UNK2C_STATE_A 0
#define UNK2C_STATE_B 10
#define UNK2C_STATE_C 11
#define UNK2C_STATE_D 19
#define UNK2C_STATE_E 20
#define UNK2C_STATE_F 30
#define UNK2C_STATE_G 40
#define UNK2C_STATE_H 50
#define UNK2C_STATE_I 60
#define UNK2C_STATE_J 90
#define UNK2C_STATE_K 100
#define UNK2C_STATE_L 110
#define UNK2C_STATE_M 111
#define UNK2C_STATE_N 112
#define UNK2C_STATE_O 120
#define UNK2C_STATE_P 200
#define UNK2C_STATE_Q 210
#define UNK2C_STATE_R 300
#define UNK2C_STATE_S 310
#define UNK2C_STATE_T 320
#define UNK2C_STATE_U 500
#define UNK2C_STATE_V 510
#define UNK2C_STATE_W 520
#define UNK2C_STATE_X 1000
#define UNK2C_STATE_Y 1010

typedef struct {
    /* 0x000 */ s32 unk0;
    /* 0x004 */ s32 unk4;
    /* 0x008 */ u8 *unk8;
    /* 0x00C */ u8 lives;
    /* 0x00D */ s8 unkD;
    /* 0x00E */ u8 unkE;
    /* 0x00F */ u8 unkF;
    /* 0x010 */ u8 unk10;
    /* 0x011 */ u8 unk11;
    /* 0x012 */ u8 unk12;
    /* 0x013 */ u8 unk13;
    /* 0x014 */ s16 unk14[5][2];
    /* 0x028 */ u8 *vram28;
    /* 0x02C */ u16 unk2C;
    /* 0x02E */ s16 unk2E;
    /* 0x030 */ u16 unk30;
    /* 0x032 */ u16 unk32;
    /* 0x034 */ s32 unk34;
    /* 0x034 */ s32 unk38;
    /* 0x03C */ s32 unk3C;
    /* 0x040 */ s32 unk40;
    /* 0x044 */ s32 unk44;
    /* 0x048 */ u8 *vram48;
    /* 0x04C */ u8 *vram4C;
    /* 0x050 */ Player *player;
    /* 0x054 */ Player *partner;
    /* 0x058 */ s32 unk58;
    /* 0x05C */ s32 unk5C;
    /* 0x060 */ s32 unk60;
    /* 0x064 */ s32 unk64;
    /* 0x068 */ Vec2_32 unk68[7];
    /* 0x0A0 */ u8 fillerA0[0x8];
    /* 0x0A8 */ Vec2_32 unkA8[7];
    /* 0x0E0 */ u8 fillerE0[0x8];
    /* 0x0E8 */ s32 unkE8;
    /* 0x0EC */ s32 unkEC;
    /* 0x0F0 */ Sprite5 sprCockpit;
    /* 0x138 */ Sprite sprGroundPlate;
    /* 0x160 */ Sprite sprHammerHead;
    /* 0x188 */ Sprite sprJoint;
    /* 0x1B0 */ SpriteTransform tf;
} EggHammerTankIII; /* 0x1BC */

void InitSpriteCockpit(EggHammerTankIII *boss);
static void InitSpriteGroundPlate(EggHammerTankIII *boss);
void UpdateGroundPlate(EggHammerTankIII *boss);
static void InitSpriteHammerHead(EggHammerTankIII *boss);
void sub_8069360(EggHammerTankIII *boss);
void sub_8069814(EggHammerTankIII *boss);
void sub_8069818(EggHammerTankIII *boss);
void sub_806A5DC(EggHammerTankIII *boss);
void sub_806A818(EggHammerTankIII *boss);
void sub_806A894(EggHammerTankIII *boss);
void sub_806A728(void);
void Task_806A760(void);
void sub_806A7A4(void);
void TaskDestructor_Boss_806A7E4(struct Task *t);
void sub_8069578(EggHammerTankIII *boss);
void sub_806A854(EggHammerTankIII *boss);
void sub_806A898(EggHammerTankIII *boss);
u8 sub_8068E5C(Player *);
void sub_8004D68(s32, s32);
bool32 sub_807A1DC(Sprite *);

extern void sub_80044CC(Player *);
extern void SetFixedRandomIfTimeAttackMode(void);
extern void sub_807A37C(void);
