#include "global.h"
#include "core.h"
#include "malloc_ewram.h"
#include "rect.h"
#include "trig.h"
#include "sprite.h"
#include "lib/m4a/m4a.h"
#include "game/camera.h"
#include "game/entity.h"
#include "game/player.h"
#include "game/stage.h"
#include "game/sa1_sa2_shared/rings_manager.h"
#include "constants/animations.h"
#include "constants/move_states.h"

void TaskDestructor_RingsMgr(Task *);
void Task_RingsMgrExtraZone();
void Task_RingsMgrStage();
void sub_802AB10(s16 arg0, s16 arg1, Player *p);
void Task_802AB8C();
void Task_802ACF0();
extern u32 *gUnknown_080CEF58[];
extern struct MP2KSongHeader song117;

typedef struct RingsManager {
    /* 0x00 */ Sprite s;
    /* 0x28 */ void *ringPositions;
} RingsManager;

typedef struct RingsMgrUnk2C {
    /* 0x00 */ Sprite s;
    /* 0x28 */ u8 unk28;
    /* 0x29 */ u8 unk29;
} RingsMgrUnk2C;

typedef struct RingsMgrUnk30 {
    /* 0x00 */ Sprite s;
    /* 0x28 */ Player *p;
    /* 0x2C */ s16 magnitude;
} RingsMgrUnk30;

#define READ_START_INDEX(p, hrc, rx, ry) (*((u32 *)((((u8 *)(p)) + (((hrc) * (ry)) * (sizeof(u32)))) + ((rx) * (sizeof(u32))))))
#define DATA_START(data)                 (void *)((u8 *)(data) - (sizeof(u32) * 2))

#define TO_REGION(pos) ((pos) >> 8)

#define REGION_LOWER(posX, bound, offset)                                                                                                  \
    ({                                                                                                                                     \
        s32 a = (posX);                                                                                                                    \
        s32 b = (bound);                                                                                                                   \
