#define NULL 0

void AddRings(s32);
void TaskDestructor_RingsMgr(Task *);
void Task_RingsMgrExtraZone();
void Task_RingsMgrStage();
void sub_802AB10(s16 arg0, s16 arg1, Player *p);
void sub_802AB8C();
void Task_802ACF0();
extern u32 *gUnknown_080CEF58[];
extern struct MP2KSongHeader song117;

typedef struct RingsManager {
    /* 0x00 */ Sprite s;
    /* 0x28 */ u8 *ringPositions;
} RingsManager;

typedef struct RingsMgrUnk2C {
    /* 0x00 */ Sprite s;
    /* 0x28 */ u8 unk28;
    /* 0x29 */ u8 unk29;
} RingsMgrUnk2C;

typedef struct RingsMgrUnk30 {
    /* 0x00 */ Sprite s;
    /* 0x28 */ Player *p;
    /* 0x2C */ s16 magnitude;
} RingsMgrUnk30;

void CreateStageRingsManager(void)
{
    Task *t;
    s32 temp_r4;
    s32 var_r0_2;
    u16 temp_r0;
    u32 **temp_r4_2;
    u32 **ringsArray;
    u32 **ringsCompressed;
    void (*var_r0)();
    RingsManager *temp_r0_2;
    s16 mapIndex = gStageData.currMapIndex;
    void *var_r5;
    Sprite *s;

    if (gStageData.gameMode != 7) {
        if (mapIndex != 72) {
            t = TaskCreate(Task_RingsMgrStage, sizeof(RingsManager), 0x2800U, 0U, TaskDestructor_RingsMgr);
        } else {
            t = TaskCreate(Task_RingsMgrExtraZone, sizeof(RingsManager), 0x2800U, 0U, TaskDestructor_RingsMgr);
        }

        // NOTE: First 4 byte of RL-compressed data contains uncompressed size.
        ringsArray = gUnknown_080CEF58;
        ringsCompressed = &ringsArray[mapIndex];
        var_r5 = EwramMalloc(**ringsCompressed >> 8);
        RLUnCompWram(*ringsCompressed, var_r5);
    }
    temp_r0_2 = TASK_DATA(t);
